app/views/users/show.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 101
---
    <strong>URL</strong> <%= link_to user_path(@user), @user %><br />
    <strong>Microposts</strong> <%= @user.microposts.count %>